first_routes/app/controllers/users_controller.rb

    def update
        old = User.find(params[:id])
        if old.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "orange"], ["updated_at", "2021-11-11 20:39:45.666443"], ["id", 1]]

    def destroy
        old = User.find_by(id: params[:id])
        if old
            old.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]

    def create
        user = User.new(user_params)
        debugger
        #user = User.new(params.require(:user).permit(:name, :email))
        if user.save!
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "banana"], ["created_at", "2021-11-11 20:10:59.223495"], ["updated_at", "2021-11-11 20:10:59.223495"]]